// 자바스크립트는 동적 타입 => 이를 엄격하게 관리하기 위해 정적 타입을 부여한게 타입스크립트

// 1. 숫자형
// 정수 및 부동소수점 숫자를 나타냅니다
// 일반적인 숫자 외에 Infinity, -Infinity, NaN와 같은 '특수 숫자 값'을 포함합니다.

// 2. BigInt

// 3. 문자형

// 4. 불린형

// 5. null
// 다른 언어에선 null을 존재하지 않는 객체에 대한 참조나 널 포인터를 나타날 때 사용
// 자바스크립트에선 존재하지 않는 값, 비어 있는 값, 알 수 없는 값을 나타내는 데 사용

// 6. undefined

// 7. 객체와 심볼
// 객체형을 제외한 다른 자료형은 문자열이든 숫자든 한 가지만 표현할 수 있기 때문에 원시 자료형이라 부릅니다
// 반면 객체는 데이터 컬렉션이나 복잡한 개체를 표현할 수 있습니다
// 심볼형은 객체의 고유한 식별자를 만들 때 사용됩니다

// 8. typeof
// 인수의 자료형을 반환
// Math -> 수학 연산을 제공하는 내장 객체라 object 반환
// null -> 하위 호환성을 위해 오류지만 남겨둠. 객체 아님
// function -> function 반환






/* ------------------------ */
/* Data Types               */
/* ------------------------ */

/* ECMAScript의 8가지 데이터 타입 -------------------------------------------- */

// 1. 존재하지 않는(nothing) 값 / 비어있는(empty) 값 / 알 수 없는(unknown) 값
// 2. 값이 할당되지 않은 상태
// 3. 따옴표를 사용해 묶은 텍스트(큰", 작은', 역`)
// 4. 정수, 부동 소수점 숫자(길이 제약)
// 5. 길이에 제약이 없는 정수(예: 암호 관련 작업에서 사용)
// 6. 참(true, yes) 또는 거짓(false, no)
// 7. 데이터 컬렉션(collection) 또는 복잡한 엔티티(entity)
// 8. 고유한 식별자(unique identifier)


/* typeof 연산자의 2가지 사용법 ---------------------------------------------- */

// 1) 연산자 typeof
// 2) 함수 typeof()

// 언어 상, 오류




// Object

// Array

// function

// this


